{
    "monster_url": "https://www.monsterref.com/pufflen_the_stoned",
    "monster_name": "Pufflen the Stoned",
    "monster_type": "Humanoid",
    "monster_alignment": "Chaotic Good",
    "armor_class": 13,
    "armor_type": "Robes",
    "hit_points": 24,
    "hit_dice": "3d8+6",
    "speed": "30 ft.",
    "strength": 10,
    "dexterity": 14,
    "constitution": 12,
    "intelligence": 16,
    "wisdom": 13,
    "charisma": 15,
    "darkvision_url": "https://www.darkvisionref.com/description",
    "darkvision": "Darkvision 60 ft.",
    "passive_perception": 11,
    "languages": "Common, Elvish, Draconic",
    "challenge": "2",
    "proficiency_bonus": 2,
    "special_ability_name": "Herbal Insight",
    "special_ability_description": "Pufflen has an uncanny ability to identify and use various herbs, especially those related to mind-altering substances. He can use these herbs to create potions that have various effects.",
    "action_name_1": "Mystic Smoke",
    "action_name_1_description": "Pufflen blows a cloud of enchanted smoke at a target within 15 feet. The target must succeed on a DC 14 Constitution saving throw or be incapacitated for 1 minute.",
    "action_name": "Fire Bolt",
    "action_description": "Ranged Spell Attack: +5 to hit, range 120 ft., one target. Hit: 10 (2d10) fire damage.",
    "hit_roll": "1d20 + 5",
    "hit_modifier": "+5",
    "reach_distance": "5 ft.",
    "damage_amount": "6 (1d8 + 2)",
    "damage_roll": "1d8 + 2",
    "damage_type": "bludgeoning",
    "character_name": "Pufflen the Stoned",
    "character_description": "Pufflen is a middle-aged Asian human wizard with a super long, platted mustache and long hair. He is often seen with a relaxed demeanor, wearing simple robes and carrying a staff adorned with various herbs.",
    "proficiencies": "Arcana, Herbalism, Nature",
    "special_skills": "Potion Brewing, Herbal Identification, Fire Bolt",
    "unique_behaviors": "Frequently takes breaks to smoke his herbs, which he claims enhances his magical abilities.",
    "typical_attitude": "Relaxed and easy-going, with a hint of mischief. He loves sharing his herbs with friends and is always eager to help.",
    "useful_knowledge": "Knows extensive details about various herbs and their effects, both magical and non-magical. Has contacts among the Woodland Elves who supply him with rare herbs.",
    "ideals": "Freedom and Fun",
    "bonds": "Deeply connected to the Woodland Elves and their way of life.",
    "flaws_or_secrets": "Occasionally becomes too reliant on his herbs, leading to moments of distraction or slow reaction times.",
    "weapons": "Staff",
    "armor": "Robes",
    "other_items": "Herbal Satchel, Pipe, Potion Ingredients",
    "backstory": "Pufflen grew up in a remote village where he was trained in the magical arts by an old sage. His love for herbs began when he discovered a hidden grove of Woodland Elves who introduced him to their special weed. Since then, Pufflen has become a beloved figure among both his human peers and his elven friends.",
    "additional_notes": "Despite his laid-back attitude, Pufflen is a skilled wizard who can be a valuable ally in battle, especially when his potions come into play. He also has a knack for getting out of sticky situations with his quick thinking and magical prowess."
}