{
    "monster_url": "https://dndbeyond.com/monsters/pufflen-the-stoned",
    "monster_name": "Pufflen the Stoned",
    "monster_type": "Humanoid",
    "monster_alignment": "Chaotic Good",
    "armor_class": 12,
    "armor_type": "Robes of the Arcane",
    "hit_points": 58,
    "hit_dice": "7d8+21",
    "speed": "30 ft.",
    "strength": 10,
    "dexterity": 14,
    "constitution": 16,
    "intelligence": 18,
    "wisdom": 12,
    "charisma": 15,
    "darkvision_url": "https://dnd5e.fandom.com/wiki/Darkvision",
    "darkvision": "Darkvision 60 ft.",
    "passive_perception": 11,
    "languages": "Common, Elvish, Draconic",
    "challenge": "CR 5",
    "proficiency_bonus": 3,
    "special_ability_name": "Herbal Knowledge",
    "special_ability_description": "Pufflen has an extensive knowledge of plants and herbs, particularly those with magical and mind-altering properties. He can identify, prepare, and use them with great proficiency.",
    "action_name_1": "Arcane Blast",
    "action_name_1_description": "Pufflen conjures a bolt of arcane energy that he can hurl at a target. Ranged Spell Attack: +7 to hit, range 120 ft., one target. Hit: 19 (3d8 + 6) force damage.",
    "action_name": "Misty Step",
    "action_description": "Briefly surrounded by silvery mist, Pufflen teleports up to 30 feet to an unoccupied space that he can see.",
    "hit_roll": "1d20 + 7",
    "hit_modifier": "+7",
    "reach_distance": "5 ft.",
    "damage_amount": "19 (3d8 + 6)",
    "damage_roll": "3d8+6",
    "damage_type": "Force",
    "character_name": "Pufflen the Stoned",
    "character_description": "Pufflen the Stoned is a wizened, Asian human wizard with super long, plaited mustache and hair. His eyes often have a glazed look, a testament to his love for the Woodland elves' dank weed. He dresses in flowing robes adorned with mystical symbols and carries a staff infused with magical herbs.",
    "proficiencies": "Arcana, Nature, Herbalism Kit",
    "special_skills": "Alchemy, Spellcasting, Potions",
    "unique_behaviors": "Often found smoking a pipe filled with various herbs, Pufflen enjoys experimenting with new magical and herbal concoctions. He is also known for his relaxed and laid-back demeanor.",
    "typical_attitude": "Chill and easygoing, preferring to solve problems through calm discussion or clever magic rather than confrontation.",
    "useful_knowledge": "Expert on various magical herbs and plants, particularly those with mind-altering effects. Knowledgeable about magical wards and protective charms.",
    "ideals": "Freedom of thought and expression",
    "bonds": "Has a deep bond with the Woodland elves, who share his love for magical herbs.",
    "flaws_or_secrets": "Has a penchant for getting lost in his own thoughts and experiments, sometimes neglecting immediate responsibilities or dangers.",
    "weapons": "Magical Staff",
    "armor": "Robes of the Arcane",
    "other_items": "Pipe of Insight, Satchel of Magical Herbs",
    "backstory": "Pufflen grew up in a secluded village known for its rich magical heritage. Fascinated by the mystical properties of herbs, he spent years studying under various masters and traveling to different realms. His journeys led him to the Woodland elves, where he discovered their dank weed, igniting his passion for all things herbal and magical.",
    "additional_notes": "Pufflen's deep knowledge of herbs makes him an invaluable ally in both combat and healing. However, his laid-back attitude can sometimes lead others to underestimate his true capabilities."
}